# TotalPathLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..TotalPathLength Property
DividedPath Class See Also
---
The sum of the curve lengths.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TotalPathLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalPathLength As Double
	Get
```

Visual C++
---
```text
public:
property double TotalPathLength {
	double get ();
}
```

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace